app/Http/Controllers/Backend/CategoryController.php

    public function index()
    {
        return view('pages.category.index', [
            'title' => 'Category',
            'data' => CategoryProduct::all(),
        ]);
---
SELECT * FROM `categories`