app/Http/Controllers/Backend/ProductController.php

    public function index()
    {
        return view('pages.product.index', [
            'title' => 'Product',
            'data' => Product::with(['category'])->orderBy('product_name', 'asc')->get(),
---
SELECT * FROM `products` ORDER BY `product_name` ASC