app/Http/Controllers/Backend/UserManagemenController.php

SELECT * FROM `users` WHERE `users`.`id` = '1' LIMIT 1
---
    public function show($id)
    {
        $user = User::findOrFail($id);